//
//  DataTypeExpression.m
//  Neighbour
//
//  Created by 杜明悦 on 2016/10/14.
//  Copyright © 2016年 杜明悦. All rights reserved.
//

#import "DataTypeExpression.h"

@implementation DataTypeExpression

/**
 返回int类型正则表达式
 */
+(NSString*) integer{
    return @"^[0-9]$";
}

/**
 返回Numeric类型正则表达式
 */
+(NSString*) numeric{
    return @"^[0-9]\.[0-9]{1,4}$|^[0-9]$";
}

/**
 返回Money类型正则表达式
 */
+(NSString*) money{
    return @"^[0-9]+(.[0-9]{2})?$";
}

/**
 返回Date类型正则表达式
 */
+(NSString*) date{
    return @"^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])-(?:29|30)|(?:0[13578]|1[02])-31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)-02-29)$";
}

/**
 返回DateTime类型正则表达式
 */
+(NSString*) dateTime{
    return @"^(((((1[6-9]|[2-9]\d)\d{2})-(0?[13578]|1[02])-(0?[1-9]|[12]\d|3[01]))|(((1[6-9]|[2-9]\d)\d{2})-(0?[13456789]|1[012])-(0?[1-9]|[12]\d|30))|(((1[6-9]|[2-9]\d)\d{2})-0?2-(0?[1-9]|1\d|2[0-8]))|(((1[6-9]|[2-9]\d)(0[48]|[2468][048]|[13579][26])|((16|[2468][048]|[3579][26])00))-0?2-29-)) (20|21|22|23|[0-1]?\d):[0-5]?\d:[0-5]?\d)$";
}

/**
 返回EMail类型正则表达式
 */
+(NSString*) eMail{
    return @"[\\w!#$%&'*+/=?^_`{|}~-]+(?:\\.[\\w!#$%&'*+/=?^_`{|}~-]+)*@(?:[\\w](?:[\\w-]*[\\w])?\\.)+[\\w](?:[\\w-]*[\\w])?";
}

/**
 返回Mobile类型正则表达式
 */
+(NSString*) mobile{
    return @"^((13[0-9])|(14[^4,\\D])|(15[^4,\\D])|(18[0-9]))\\d{8}$|^1(7[0-9])\\d{8}$";
}

/**
 返回phone类型正则表达式
 */
+(NSString*) phone{
    return @"((\d{11})|^((\d{7,8})|(\d{4}|\d{3})-(\d{7,8})|(\d{4}|\d{3})-(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1})|(\d{7,8})-(\d{4}|\d{3}|\d{2}|\d{1}))$)";
}

/**
 身份证号正则表达式
 @return 身份证号表达式
 */
+ (NSString*) idCard{
    return @"/^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/";
}

/**
 url正则表达式
 @return url表达式
 */
+ (NSString*) url
{
    return @"[a-zA-z]+://[^\s]*";
}
@end

